In [0]:
import pandas as pd

In [0]:
# insert data directly using StringIO to generate a CSV-like for pandas

from io import StringIO

data = StringIO("""
Text,Value
aaa,123
bbb,456
ccc,789
""")

data2 = StringIO("""
Text,Value2
bbb,Milano
ccc,Roma
ddd,Bologna
eee,Venezia
""")


df1 = pd.read_csv(data)
df2 = pd.read_csv(data2)

df1.head(5)

  Text  Value
0  aaa    123
1  bbb    456
2  ccc    789

In [0]:
# recreate the index a column "Text" and name it as "My_Index"

df1.index = df1['Text']
df1.index.name = "My_Index"
df1.index

Index(['aaa', 'bbb', 'ccc'], dtype='object', name='My_Index')

In [0]:
# Verify that the index is correct

df1

         Text  Value
My_Index
aaa       aaa    123
bbb       bbb    456
ccc       ccc    789

In [0]:
# recreate the index a column "Text" and name it as "My_Index"

df2.index = df2['Text']
df2.index.name = "My_Index2"
df2.index

Index(['bbb', 'ccc', 'ddd', 'eee'], dtype='object', name='My_Index2')

In [0]:
# (Default Left) Join df1 <- df2 and append a suffix to df2 column name if it overlap with df1 ( ex: Text )

joined_df1 = df1.join(df2, rsuffix="-df2")
joined_df1

         Text  Value Text-df2  Value2
My_Index
aaa       aaa    123      NaN     NaN
bbb       bbb    456      bbb  Milano
ccc       ccc    789      ccc    Roma

In [0]:
# (Default Left) Join df2 <- df1 and append a suffix to df1 column name if it overlap with df1 ( ex: Text )

joined_df2 = df2.join(df1, rsuffix="-df1")
joined_df2

          Text   Value2 Text-df1  Value
My_Index2
bbb        bbb   Milano      bbb  456.0
ccc        ccc     Roma      ccc  789.0
ddd        ddd  Bologna      NaN    NaN
eee        eee  Venezia      NaN    NaN

In [0]:
# Right Join df2 <- df1 

joined_df2 = df2.join(df1, rsuffix="-df1", how="right")
joined_df2

         Text  Value2 Text-df1  Value
My_Index
aaa       NaN     NaN      aaa    123
bbb       bbb  Milano      bbb    456
ccc       ccc    Roma      ccc    789